tutorials/19pipe_coupON/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6868;
        startFace       432956;
    }
    outlet
    {
        type            patch;
        nFaces          1445;
        startFace       439824;
    }
    inlet
    {
        type            patch;
        nFaces          1445;
        startFace       441269;
    }
)

// ************************************************************************* //
