tutorials/19pipe_coupON/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     volScalarField;
    object    p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {

    	type            totalPressure;  // pressure drop
    	p0              uniform 4.0e-06;  // pressure drop
    	
        //type            fixedValue;   
        //value           uniform 3.5e-06;

//type 	        zeroGradient;  
    }

    walls
    { 
        type 	        zeroGradient;    // pressure drop
    }

    outlet
    {
       //type            fixedValue;
       //value           uniform 0; 

	type            totalPressure; // pressure drop
    	p0              uniform 0; // pressure drop
    }	
}

// ************************************************************************* //
